<?php 
require_once 'db.inc.php';
header("content-Type: text/html; charset=utf-8");
$g_result = array('100'=>'无','99'=>'成功','101'=>'超时','111'=>'权限不足','112'=>'角色不在线');

$g_language = array('0'=>'全语言','1'=>'阿拉伯语','9'=>'荷兰语','10'=>'英语','14'=>'法语','15'=>'德语','20'=>'印尼','21'=>'意大利语','22'=>'日语',
'23'=>'韩语','27'=>'波兰语','28'=>'葡萄牙语','30'=>'俄语','34'=>'西班牙语','36'=>'泰语','37'=>'土耳其语','40'=>'中文简体','41'=>'中文繁体');

$g_channeid = array('0'=>'全渠道','3'=>'UC','4'=>'360','24'=>'百度','6'=>'小米','16'=>'应用宝','32'=>'金立','17'=>'联想','15'=>'华为','21'=>'OPPO','23'=>'vivo','31'=>'酷派',
'30'=>'安智','27'=>'拇指玩','35'=>'爱奇艺PPS','36'=>'PPTV','45'=>'搜狗','10'=>'豌豆荚','53'=>'新浪','56'=>'优酷土豆');

$g_actname = array(1=>'巨龙之日',2=>'巨龙之怒',4=>'限时活动',5=>'光之礼赞',7=>'雪人洞穴',8=>'情人节',9=>'国王战',10=>'复活节',11=>'仲夏节',12=>'仲夏夜之王',40=>'活动礼包1',41=>'活动礼包2',42=>'活动礼包3',43=>'活动礼包4',44=>'活动礼包5');

$g_amtypename = array(1=>'采集',2=>'造兵',3=>'战力提升',4=>'击杀野怪',5=>'屠杀活动');

$g_topname = array(0=>'刷之前执行 ',1=>'领主等级榜 ',2=>'城池战力榜 ',3=>'主城等级榜  ',4=>'城池消灭敌军榜',5=>'联盟战力榜',6=>'联盟消灭敌军榜',7=>'循坏赛阶段榜',8=>'循环赛总榜');

$g_buffname = array(1=>'战争守护',5=>'攻击加成',7=>'防御加成',9=>'少量消耗',11=>'大量消耗',13=>'反侦察',16=>'采集速度');

$g_scname = array(1=>'刷资源点',2=>'刷野怪',3=>'刷龙穴',5=>'巨龙之日刷怪', 8=>'刷集结怪（刷新）', 10=>'刷集结怪（补充）', 11=>'开启雪人巢穴', 12=>'雪人巢穴刷怪', 13=>'结束雪人巢穴');

$g_BuildingName = array(1=>'古堡',2=>'城墙',6=>'通灵学院',7=>'祈愿圣坛',8=>'亡者大厅',9=>'炼金工坊',
10=>'不死校场',11=>'地窖',12=>'伐木场',13=>'魂力之泉',14=>'闹鬼矿场',15=>'水银提炼',16=>'埋骨之地',17=>'地穴',18=>'绝望殿堂',19=>'骨场',
20=>'上古灵柩',21=>'金字塔',23=>'通灵眼',24=>'暗黑天幕',25=>'大型祭坛');

$g_UnitTypeName = array(1=>'城池',2=>'部队',3=>'资源点',4=>'怪物',5=>'城镇',6=>'庇护所',7=>'集结怪' );
$g_CorpsName = array(1=>'步兵',2=>'骑兵',3=>'飞兵',4=>'法师',5=>'弓兵',6=>'幽魂' );
$g_CorpsLV = array(1=>'LV.1',2=>'LV.2',3=>'LV.3',4=>'LV.4',5=>'LV.5',6=>'LV.6',7=>'LV.7',8=>'LV.8',9=>'LV.9',10=>'LV.10' );
$g_ArmyStateName = array(0=>'无',1=>'发起集结',2=>'集结中',3=>'集结完毕',4=>'准备中',10=>'行军中',11=>'包围中',20=>'战斗中',21=>'驻扎中',22=>'采集中',23=>'庇护中',24=>'援助中',30=>'返程中' );
$g_ArmyActionName = array(0=>'无',1=>'去战斗',2=>'去驻扎',3=>'去采集',4=>'去庇护',5=>'去资源援助',6=>'去士兵援助',7=>'去建造',8=>'去驻扎堡垒',10=>'发起集结',11=>'去集结',12=>'去交谈',13=>'去包围' );

$g_CityResName = array(1=>'木材',2=>'魂力',3=>'铁矿',4=>'水银',5=>'钻石',6=>'联盟荣誉',7=>'魔神之血',11=>'安全木材',12=>'安全魂力',13=>'安全铁矿',14=>'安全水银' );

$g_BuildingName = array(1=>'古堡',2=>'城墙',3=>'预留',4=>'预留',5=>'预留',6=>'通灵学院',7=>'祈愿圣坛',8=>'亡者大厅',9=>'炼金工坊',10=>'招魂塔',
11=>'地窖',12=>'伐木场',13=>'魂力之泉',14=>'闹鬼矿场',15=>'水银提炼',16=>'埋骨之地',17=>'地穴',18=>'绝望殿堂',19=>'骨场',20=>'上古灵柩',
21=>'金字塔',22=>'亡者堡垒',23=>'通灵眼',24=>'暗黑天幕',25=>'大型祭坛',26=>'预留',27=>'预留',28=>'预留',29=>'预留',30=>'预留');

$g_QuestType = array(0=>'主线',1=>'支线' );
$log_op_text = array(0=>'所有操作',1=>'钻石',2=>'英雄',3=>'获得道具',4=>'丢失道具',5=>'城池资源',6=>'角色经验',7=>'角色升级',8=>'体力',9=>'vip经验',10=>'vip开启',
11=>'建筑操作',12=>'建筑操作完毕',13=>'部队改变',14=>'伤兵改变',15=>'龙晶',16=>'联盟积分',17=>'创建联盟',18=>'解散联盟',19=>'进入联盟',20=>'离开联盟',
21=>'联盟任务',22=>'联盟科技',23=>'获得任务',24=>'使命',25=>'NPC攻城',26=>'循环赛',27=>'绑定账号',28=>'邪神之血',29=>'出征',30=>'领取任务奖励',
31=>'学习天赋',32=>'重置天赋',33=>'联盟建筑-城镇',34=>'联盟建筑-仓库',35=>'联盟建筑-软泥怪',36=>'联盟建筑资源',37=>'联盟建筑资源',38=>'城池被插白旗',39=>'城池移除白旗',40=>'逻辑帧',
41=>'出征攻打城池');


$log_path_text = array(-1=>'任何途径',1=>'系统',2=>'GM',3=>'充值',4=>'使用道具',5=>'售卖丢弃',6=>'建筑建造',7=>'建筑立即建造',8=>'建筑升级',9=>'建筑立即升级',10=>'建筑立即完成',
11=>'收取',12=>'剧情事件',13=>'购买操作',14=>'兵种训练',15=>'兵种立即训练',16=>'升级',17=>'兵种立即升级',18=>'兵种治疗',19=>'兵种立即治疗',20=>'道具资源增益',
21=>'邮件附件',22=>'离线礼物',23=>'任务',24=>'联盟',25=>'战斗结束',26=>'科技立即研发',27=>'吃粮食',28=>'野外采集',29=>'城镇战斗',30=>'帮助',
31=>'登陆奖励',32=>'时长奖励',33=>'角色升级奖励',34=>'许愿',35=>'活跃度',36=>'钻石购买使用',37=>'联盟商店',38=>'解锁城外地块',39=>'城池科技',40=>'技能',
41=>'出征',42=>'解雇',43=>'骰子',44=>'集结拆分返回',45=>'使命',46=>'集结',47=>'活动',48=>'联盟科技',49=>'联盟龙技',50=>'联盟任务',
51=>'GM充值',52=>'取消操作',53=>'材料打造',54=>'材料开格子',55=>'材料合成',56=>'装备合成',57=>'装备锻造',58=>'装备锻造立即',59=>'装备进化',60=>'装备分解',
61=>'取消研究科技',62=>'彩蛋',63=>'时空裂隙',64=>'成长活动',65=>'联盟建筑建造',66=>'联盟建筑删除');

$log_actorbuy_text = array(-1=>'建筑队列',-2=>'资源增益',-3=>'迁城',-4=>'灭火',-5=>'道具使用',-6=>'改名',-7=>'改形象' );

$g_productid=array( 2128=>'0.99', 2129=>'4.99', 2130=>'9.99', 2131=>'19.99', 2132=>'49.99', 2133=>'99.99', 2233=>'0.99', 2234=>'4.99', 2235=>'9.99', 2236=>'19.99', 2237=>'49.99', 2238=>'99.99', 2240=>'26.99', 2239=>'6.99' );

$g_talk_auto_name = array( 0=>'侦查',1=>'防御',2=>'攻击',3=>'联盟邀请',4=>'联盟踢出',5=>'权限提升',6=>'权限降低',7=>'成员加入',8=>'成员退出',9=>'分享坐标',10=>'军队集结',
11=>'请求援助',12=>'联盟创建',13=>'联盟邀请',14=>'联盟骰子',15=>'联盟骰子',16=>'联盟骰子',17=>'联盟骰子',18=>'冰霜巨龙复活' );

function wlogop( $op )
{
	$db = new dbstuff;
	$pconnect = 0;
	$name = $_SESSION["adminname"];
	$db->connect( $dbh, $dbu, $dbp, $dbd, 0 );

	$myip = $_SERVER["REMOTE_ADDR"];
	$sql="INSERT INTO oplog (name,op,ip,optime) values('$name','$op','$myip',now())";
	$db->query($sql);
}
?>